app/controllers/kml_bundle_controller.rb

  def transmit
    @user = User.find_by_id(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1