app/controllers/play_controller.rb

  def index
    @title = "Play KarunaTree"
    @user = User.get_current_user(session)
    @scene = Scene.find_by_scene_number(@user.character.current_scene)
---
SELECT * FROM `scenes` WHERE (`scenes`.`scene_number` = 8) LIMIT 1

  def earth_ready
    @character = User.get_current_user(session).character
    @scene = Scene.find_by_scene_number(@character.current_scene)
---
SELECT * FROM `scenes` WHERE (`scenes`.`scene_number` = 8) LIMIT 1

  def next
    @character = User.get_current_user(session).character
    @last_scene = Scene.find_by_scene_number(@character.current_scene)
    @character.current_scene += 1
    @scene = Scene.find_by_scene_number(@character.current_scene)
    @character.save
---
SELECT * FROM `scenes` WHERE (`scenes`.`scene_number` = 2) LIMIT 1
UPDATE `characters` SET `updated_at` = '2009-12-18 21:01:34', `current_scene` = 2 WHERE `id` = 3

  def back
    @character = User.get_current_user(session).character
    @last_scene = Scene.find_by_scene_number(@character.current_scene)
    @character.current_scene -= 1
    @scene = Scene.find_by_scene_number(@character.current_scene)
    @character.save
---
SELECT * FROM `scenes` WHERE (`scenes`.`scene_number` = 7) LIMIT 1
UPDATE `characters` SET `updated_at` = '2009-12-18 21:00:57', `current_scene` = 7 WHERE `id` = 3