app/controllers/user_controller.rb

  def signup
    @title = "Sign Up for KarunaTree"

    if param_posted?(:user)
      @user = User.new(params[:user])
      @user.build_character
      if @user.save
---
INSERT INTO `characters` (`created_at`, `updated_at`, `current_scene`, `user_id`) VALUES('2009-12-18 05:04:49', '2009-12-18 05:04:49', 1, 7)
INSERT INTO `users` (`created_at`, `updated_at`, `username`, `character_id`, `password`, `email`, `authorization_token`) VALUES('2009-12-18 04:24:08', '2009-12-18 04:24:08', 'felix', NULL, 'Felixo', 'felix.orangutango@hellofelix.com', NULL)

  def login
    @title = "Log In to KarunaTree"
    if request.get?
      @user = User.new(:remember_me => remember_me_string)
    elsif param_posted?(:user)
      @user = User.new(params[:user])
      user = User.find_by_username_and_password(@user.username, @user.password)
---
SELECT * FROM `users` WHERE (`users`.`username` = 'derek' AND `users`.`password` = 'Orangu') LIMIT 1

  def index
    @title = "KarunaTree User Hub"
    @user = User.get_current_user(session)
    @scene = Scene.find_by_scene_number(@user.character.current_scene)
---
SELECT * FROM `scenes` WHERE (`scenes`.`scene_number` = 1) LIMIT 1

  def next
    @character = User.get_current_user(session).character
    @character.current_scene += 1
    @scene = Scene.find_by_scene_number(@character.current_scene)
    @character.save
---
SELECT * FROM `scenes` WHERE (`scenes`.`scene_number` = 4) LIMIT 1
UPDATE `characters` SET `updated_at` = '2009-12-18 05:45:07', `current_scene` = 2 WHERE `id` = 3

  def back
    @character = User.get_current_user(session).character
    @character.current_scene -= 1
    @scene = Scene.find_by_scene_number(@character.current_scene)
    @character.save
---
SELECT * FROM `scenes` WHERE (`scenes`.`scene_number` = 2) LIMIT 1
UPDATE `characters` SET `updated_at` = '2009-12-18 05:48:19', `current_scene` = 4 WHERE `id` = 3